{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js Converter",
  "convertedBy": "Livestock AI Platform (Mock Model for Testing)",
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "cattle_disease_model",
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [null, 224, 224, 3],
            "dtype": "float32",
            "sparse": false,
            "name": "input"
          }
        },
        {
          "class_name": "Flatten",
          "config": {
            "data_format": "channels_last",
            "name": "flatten"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 4,
            "activation": "softmax",
            "use_bias": false,
            "name": "output"
          }
        }
      ]
    }
  },
  "trainingConfig": null,
  "weightsManifest": [
    {
      "paths": ["model.weights.bin"],
      "weights": [
        {
          "name": "output/kernel",
          "shape": [150528, 4],
          "dtype": "float32"
        }
      ]
    }
  ]
}
